import azure.cognitiveservices.speech as speechsdk
from dotenv import dotenv_values

def text_to_speech(text, output_file="output.wav"):
    config = dotenv_values("configs/.env")
    speech_key = config["speech_key"]
    service_region = config["service_region"]

    speech_config = speechsdk.SpeechConfig(subscription=speech_key, region=service_region)
    speech_config.set_speech_synthesis_output_format(speechsdk.SpeechSynthesisOutputFormat.Riff22050Hz16BitMonoPcm)
    speech_config.speech_synthesis_voice_name = 'bg-BG-KalinaNeural'

    audio_config = speechsdk.audio.AudioOutputConfig(filename=output_file)
    synthesizer = speechsdk.SpeechSynthesizer(speech_config=speech_config, audio_config=audio_config)

    result = synthesizer.speak_text_async(text).get()

    if result.reason == speechsdk.ResultReason.SynthesizingAudioCompleted:
        return True
    else:
        print(f"Error: {result.cancellation_details.error_details}")
        return False

text_to_speech(
    """
    ПРАВИЛА ЗА БЕЗОПАСНОСТ ПРИ БОРАВЕНЕ С ОГНЕСТРЕЛНО оръжие
    1. Стреля се само с технически изправни огнестрелни оръжия.
    2. За стрелба с всяко огнестрелно оръжие се използват само боеприпаси, за които то е конструктивно предназначено.
    3. Всяко огнестрелно оръжие, преди да бъде проверено, се счита за заредено и с освободен предпазител!
    4. Показалецът на стрелящата ръка се поставя върху спусъка непосредствено преди изстрела. Във всички други моменти той трябва да е поставен извън спусковата скоба.
    5. Никога не се насочва огнестрелно оръжие към човек независимо от увереността, че то е празно. Това е допустимо само при намерение и право той да бъде прострелян или респектиран.
    6. Оръжието се проверява за наличието на патрон в патронника на цевта в следната последователност:
    показалецът на стрелящата ръка е извън спусковата скоба и е поставен по нейното протежение
    отделя се пълнителят
    при освободен предпазител се отваря затворният блок и задължително се оглежда патронникът на цевта за наличието в него на патрон
    оръжието се насочва в безопасна посока и се прави контролно спускане
    7. Забранява се гледането отпред в цевта на оръжие със затворен затвор, което не е проверено за наличие на боеприпаси.
    8. При зареждане на всяко оръжие цевта трябва да е насочена в безопасна посока съобразно обстановката, а на територията на стрелбище - към мишените! Показалецът трябва да е извън спусковата скоба.
    9. Засечки при стрелба се отстраняват в следната последователност, оръжието се държи насочено в безопасна посока, изваждат се показалецът от спусковата скоба, пълнителят от оръжието и накрая патронът от патронника на цевта.
    10. При стрелба с две ръце с пистолет палецът на нестрелящата ръка не трябва да е зад затвора на оръжието, а да с поставен върху или до палеца на стрелящата, за да не бъде контузен.
    11. Забранява се да се предава заредено оръжие от едно лице на друго без поставен предпазител. При предаване на оръжие от едно лице на друго предаващият съобщава високо и ясно дали оръжието е празно, заредено или пълно.
    12. Никога не се подава оръжие на друго лице с насочена към него или към подаващия цев. Дори оръжието да е празно цевта трябва да сочи в безопасна посока.
    13. Стрелбата по цел, намираща се над бетон, камък, лед и вода, с опасна, защото може да доведе до рикошети на куршумите или сачмите.
    ІІ. На територията на стрелбище:
    14. Лица, които не познават правилата за безопасност при боравене с огнестрелно оръжие и боеприпаси, не се допускат до стрелба!
    15. До стрелба с бойно огнестрелно оръжие срещу заплащане се допускат само лица, навършили 18 годишна възраст, които предварително са били инструктирани за тези правила за безопасност при боравене с огнестрелно оръжие от съответното длъжностно лице на стрелбището.
    16. Не се допускат до стрелба лица в нетрезво състояние, под влияние на наркотични вещества или с явно психическо разстройство.
    17. Забранява се продажбата и консумацията на алкохол на територията на стрелбища.
    18. За всяко стрелбище, съобразно конструктивните му особености, се изготвя заповед относно специфичните правила за безопасност при провеждането на стрелби с посочени в нея длъжности лица.
    19. При стрелба по метални мишени се забранява обстрелването им от дистанция по-малка от 7 м.
    20. Стрелба може да се провежда само в присъствието на треньор, инструктор, преподавател или друго длъжностно лице, посочено в заповедта по точка 18.
    21. Ръководителят на стрелбата има право да отстранява от огневата линия всяко лице при нарушаване на правилата за безопасност при боравене с огнестрелно оръжие.
    22. Осигуряват се антифони за стрелящите и персонала на стрелбището за защита на слуховия апарат. Препоръчва се използването и на защитни очила (по възможност със странични предпазители) за избягване на нараняванията от изхвърлени гилзи, барутни частици, камъчета и др. 
    23. оръжието се изважда от кобура, калъфа или транспортния куфар само на определените за това места.
    24. оръжието се насочва единствено от огневата линия към целта. Забранено е насочването му встрани и назад.
    """,
    "part2.wav"
    )
